//output40
#import <Foundation/Foundation.h>

int main(int argc, const char * argv[])
{

    @autoreleasepool {
    
		NSLog(@"%f %f %f", 123.456, 1.23456, 12.34567);
		NSLog(@"%f %f %f", 12.345, 123456.78, 1.234567);
		
		NSLog(@"\n利用欄位寬加以輸出(向右靠齊): ");
		NSLog(@"%11.2f %11.2f %11.2f", 123.456, 1.23456, 12.34567);
		NSLog(@"%11.2f %11.2f %11.2f", 12.345, 123456.78, 1.234567);
		
		NSLog(@"\n利用欄位寬加以輸出(向左靠齊): ");    
		NSLog(@"%-11.2f %-11.2f %-11.2f", 123.456, 1.23456, 12.34567);
		NSLog(@"%-11.2f %-11.2f %-11.2f", 12.345, 123456.78, 1.234567);
	
    }
    return 0;
}
